/*
#123. 地毯
内存限制：256 MiB
时间限制：1000 ms
标准输入输出
题目类型：传统
评测方式：文本比较
上传者： admin
用户限制： Lv.0
题目描述
此题约为NOIP提高组Day2T1难度。

在n * n的格子上有m个地毯。

给出这些地毯的信息，问每个点被多少个地毯覆盖。

输入格式
第一行，两个正整数n、m。意义如题所述。

接下来m行，每行两个坐标(x1,y1)和(x2,y2)，代表一块地毯，左上角是(x1,y1)，右下角是(x2,y2)。

输出格式
输出n行，每行n个正整数。

第i行第j列的正整数表示(i,j)这个格子被多少个地毯覆盖。

样例
input
5 3
2 2 3 3
3 3 5 5
1 2 1 4

output
0 1 1 1 0
0 1 1 0 0
0 1 2 1 1
0 0 1 1 1
0 0 1 1 1


 复制
样例解释

0 0 0 0 0         0 0 0 0 0        0 1 1 1 0
0 1 1 0 0         0 1 1 0 0        0 1 1 0 0
0 1 1 0 0    ->   0 1 2 1 1   ->   0 1 2 1 1
0 0 0 0 0         0 0 1 1 1        0 0 1 1 1
0 0 0 0 0         0 0 1 1 1        0 0 1 1 1


数据范围与提示
对于20%的数据，有n<=50，m<=100。

对于100%的数据，有n<=1000，m<=1000000。
*/
#include<bits/stdc++.h>
using namespace std;
int s[5005][5005];
int main(){
	int n,m,x1,x2,y1,y2;
	scanf("%d%d",&n,&m);
	for(int i=1;i<=m;i++){
		scanf("%d%d%d%d",&x1,&x2,&y1,&y2);
		s[x1][x2]=s[x1][x2]+1;
		s[x1][y2+1]=s[x1][y2+1]-1;
		s[y1+1][x2]=s[y1+1][x2]-1;
		s[y1+1][y2+1]=s[y1+1][y2+1]+1;
	}
	for(int i=1;i<=n;i++){
		for(int j=1;j<=n;j++){
		s[i][j]=s[i-1][j]+s[i][j-1]-s[i-1][j-1]+s[i][j];
		printf("%d",s[i][j]);
		cout<<" ";
		}
		printf("\n");
	}
	return 0;
}
