#include<bits/stdc++.h>
using namespace std;
int main(){
	cout<<" "<<endl;
	cout<<" "<<endl;
	cout<<" "<<endl;
	cout<<" "<<endl;
	cout<<" "<<endl;
	cout<<"                             "<<"*"<<"********"<<"*"<<"                "<<"*"<<"********"<<"*"<<endl;
	cout<<"                              "<<"*"<<"天 老 吉"<<"*"<<"              "<<"*"<<"心 H  母"<<"*"<<endl;
	cout<<"                               "<<"*"<<"天 妈 祥"<<"*"<<"            "<<"*"<<"想 a  亲"<<"*"<<endl;
	cout<<"                                "<<"*"<<"开 节 如"<<"*"<<"          "<<"*"<<"事 p  节"<<"*"<<endl;
	cout<<"                                 "<<"*"<<"心 日 意"<<"*"<<"        "<<"*"<<"成 p  快"<<"*"<<endl;
	cout<<"                                  "<<"*"<<"身 快 寿"<<"*"<<"      "<<"*"<<"好 y  乐"<<"*"<<endl;
	cout<<"                                   "<<"*"<<"体 乐 比"<<"*"<<"    "<<"*"<<"运 !  ! "<<"*"<<endl;
	cout<<"                                    "<<"*"<<"棒  ! 南"<<"*"<<"  "<<"*"<<"连 !  !"<<"*"<<endl;
	cout<<"                                     "<<"*"<<"!  ! 山 "<<"*"<<""<<"*"<<"连    ! "<<"*"<<endl;
	cout<<"                                      "<<"*"<<"   感      谢   "<<"*"<<endl;
	cout<<"                                       "<<"*"<<" 你给了我生命 "<<"*"<<endl;
	cout<<"                                        "<<"*"<<"  越    年  "<<"*"<<endl;
	cout<<"                                         "<<"*"<<" 来    轻 "<<"*"<<endl;
	cout<<"                                          "<<"*"<<"越    ! "<<"*"<<endl;
	cout<<"                                           "<<"*"<<" 美丽 "<<"*"<<endl;
	cout<<"                                            "<<"*"<<"!  !"<<"*"<<endl;
	cout<<"                                             "<<"*"<<"！!"<<"*"<<endl;
	cout<<"                                              "<<"*"<<""<<"*"<<endl;
	return 0;            
}
